# Итоговая контрольная работа по основному блоку
*Задача*: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Решение
* Инициализируем массив строк и переменную для подсчёта нужных слов.
    ```
    string[] words = new string[] { "Дерево", "Кот" , "Пепега", "Мяу", 
                                "Эх", "Сон", "Четыре", "Три",
                                "Мир", "Труд", "Май", ":3"};
    int lthan3s = 0;
    ```
* В начальном массиве подсчитываем количество нужных слов.
    ```
    foreach(string word in words)
    {   
        if(word.Length < 4)
        {
            lthan3s++;
        }
    }
    ```
* Инициализируем массив ответов длиной в количество нужных слов и переменную для записи ответов в данный массив.
    ```
    string[] result = new string[lthan3s]; 
    int forward = 0;
    ```
* Ищем слова требуемой длины в начальном массиве и записываем их в массив ответов.
    ```
    foreach(string word in words)
    {
        if(word.Length < 4)
        {
            result[forward++] = word;
        }
    }
    ```
* Выводим в консоль все слова из массива ответов.
    ```
    foreach(string word in result)
    {
        Console.WriteLine(word);
    }
    ```