# Итоговая контрольная работа по основному блоку
*Задача*: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
## Решение

* Инициализируем массив строк, желательно найти несколько осмысленных слов из 3 символов, возможно старые смайлы.
* Для каждого элемента массива находим длину.
    > words[i].Length
* Записываем элементы с длиной 3 или меньше в новый массив.
* Выводим новый массив.
    > Console.WriteLine()

